ckeller42/kws-de/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64
CONFIG_FATFS_USE_LABEL=y
CONFIG_WL_SECTOR_SIZE_4096=y
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=4096
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# Quad I/O flash: the CoreS3 module supports it (Espressif's own BSP defaults to
# QIO for this board) and it roughly doubles the rate at which code and rodata
# stream in from flash. Everything hot here executes and reads from flash
# through the caches, so this is the cheapest bandwidth on offer.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# 1 kHz tick. At 100 Hz the bare vTaskDelay(1) in the wake catch-up loop slept a
# whole 10 ms tick after every Invoke, capping backlog drain at ~2x realtime; at
# 1 kHz it is a 1 ms yield and ~5x. Every pdMS_TO_TICKS() call site scales on its
# own. The tick ISR is in IRAM and driven by the systimer, so 10x the ticks costs
# well under 1% of a core.
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_64KB=y
# A microSD in the slot becomes the recording volume (storage.c). Cards ship
# with anything or nothing on them, so one that probes but carries no readable
# filesystem is reformatted FAT on first use rather than silently falling back
# to the 12 MB flash partition — the card is data-collection scratch space, not
# somewhere anything is kept. The internal partition is never formatted.
CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL=y
